{
  "backend/main.mo": "Marketplace canister with access control, user and seller profiles, and listing management logic.",
  "feature_evidence.json": "Empty feature evidence report scaffold.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files for reference.",
  "frontend/.env": "Environment variables for site verification and public base URL.",
  "frontend/.env.example": "Template showing required environment variable fields for deployment.",
  "frontend/index.css": "Global Tailwind CSS setup defining light/dark theme variables and base styles.",
  "frontend/index.html": "Main HTML template with SEO tags, JSON‑LD, and runtime fallback for public URL.",
  "frontend/public/googleb1147599673a3710.html": "Static Google site‑verification file.",
  "frontend/public/robots.txt": "Robots rules allowing all crawlers and referencing sitemap.",
  "frontend/public/sitemap.xml": "Static sitemap listing three main routes with metadata.",
  "frontend/public/static-html-example.html": "Standalone static HTML demo page served directly from /public.",
  "frontend/scripts/generate-sitemap.mjs": "Node script generating sitemap.xml using VITE_PUBLIC_URL and predefined routes.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, theme provider, and global layout.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button with handling for reauth and cache clearing.",
  "frontend/src/components/branding/BrandHeader.tsx": "Shows two branding images: a logo and animated mascot side by side.",
  "frontend/src/components/common/EmptyState.tsx": "Displays an empty-state message with optional action button and icon.",
  "frontend/src/components/common/LoadingState.tsx": "Simple loading indicator with spinning icon and message.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the global app layout with header, footer, background pattern, and navigation.",
  "frontend/src/components/listings/CategoryFilter.tsx": "Renders category buttons and notifies when a category is selected.",
  "frontend/src/components/listings/ImageUploader.tsx": "Manages up to three image uploads, previews, and removal using data URLs.",
  "frontend/src/components/listings/ListingCard.tsx": "Displays a product card with image, title, price, and quantity, triggering click handler.",
  "frontend/src/components/listings/ListingForm.tsx": "Form for creating or editing listings with presets, validation, and image uploads.",
  "frontend/src/components/listings/ListingGrid.tsx": "Shows a grid of listings with loading and empty states and navigation on click.",
  "frontend/src/components/listings/listingPresets.ts": "Provides preset listing templates with predefined fields like title, description, and price.",
  "frontend/src/components/sellers/SellerDisplayName.tsx": "Fetches and displays a seller's display name or a fallback if unavailable.",
  "frontend/src/hooks/mutations/useCreateListing.ts": "Mutation hook to create a new listing and refresh related queries.",
  "frontend/src/hooks/mutations/useCreateSellerProfile.ts": "Mutation hook to create a seller profile and invalidate relevant queries.",
  "frontend/src/hooks/mutations/useDeactivateListing.ts": "Mutation hook to deactivate a listing and refresh listing-related queries.",
  "frontend/src/hooks/mutations/useSaveUserProfile.ts": "Mutation hook to save the caller's user profile and refresh it.",
  "frontend/src/hooks/mutations/useUpdateListing.ts": "Mutation hook to update a listing and invalidate related caches.",
  "frontend/src/hooks/queries/useCurrentUserProfile.ts": "Query hook fetching the caller's user profile with actor readiness checks.",
  "frontend/src/hooks/queries/useIsSeller.ts": "Query hook checking whether the caller is registered as a seller.",
  "frontend/src/hooks/queries/useListingDetail.ts": "Query hook fetching a single listing by ID when actor is ready.",
  "frontend/src/hooks/queries/useListings.ts": "Query hook fetching all listings by aggregating listings from all sellers.",
  "frontend/src/hooks/queries/useMyListings.ts": "Query hook fetching listings belonging to the authenticated user's principal.",
  "frontend/src/hooks/queries/useSellers.ts": "Provides a React Query hook to fetch a seller profile using the current actor, returning null on errors.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling identity loading, login, logout, and status tracking.",
  "frontend/src/index.css": "Defines global Tailwind layers and CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage with search, category filter, and listing grid using fetched listings.",
  "frontend/src/pages/ListingDetailPage.tsx": "Shows detailed listing info, owner actions, copy/share tools, and handles listing deactivation.",
  "frontend/src/pages/ProfilePage.tsx": "Displays user profile and their listings, prompting profile setup and supporting profile saving.",
  "frontend/src/pages/PublishingSharePage.tsx": "React page for sharing deployment URLs, custom domains, and environment snippets with copy-to-clipboard and validation logic.",
  "frontend/src/pages/SellCreateListingPage.tsx": "Page for authenticated users to create new listings using a form and mutation, with error handling and redirects.",
  "frontend/src/pages/SellEditListingPage.tsx": "Page allowing listing owners to load, edit, and submit updates to an existing listing with ownership checks.",
  "frontend/src/utils/canisterErrors.ts": "Parses backend canister errors and maps them to user-friendly messages.",
  "frontend/src/utils/customDomain.ts": "Validates custom domain input, normalizes it, blocks unwanted domains, and manages localStorage persistence.",
  "frontend/src/utils/publicUrl.ts": "Retrieves the app’s public URL from env vars or window origin, plus the current deployment URL.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL parameters with sessionStorage support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, typography, and container settings.",
  "project_state.json": "Stores project metadata and a pending feature request for adding a full e-commerce selling and buying flow. Contains state versioning, summaries, and feature-tracking fields."
}