{
  "backend/main.mo": "Marketplace canister implementing access control, user and seller profiles, and listing management with authorization checks.",
  "feature_evidence.json": "Metadata file documenting implemented publishing-related features, affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of all major frontend React components, hooks, and pages.",
  "frontend/index.css": "Tailwind CSS base configuration defining theme variables for light and dark modes and global styling rules.",
  "frontend/index.html": "Base HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, wraps pages in AppLayout, and configures theming and toast UI.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button that manages authentication state and clears query cache on logout.",
  "frontend/src/components/branding/BrandHeader.tsx": "Displays the app's logo and animated mascot images.",
  "frontend/src/components/common/EmptyState.tsx": "Reusable empty state component showing an icon, message, and optional action button.",
  "frontend/src/components/common/LoadingState.tsx": "Reusable loading component with a spinning icon and loading message.",
  "frontend/src/components/layout/AppLayout.tsx": "Top-level layout providing header, footer, background pattern, navigation, and slot for page content.",
  "frontend/src/components/listings/CategoryFilter.tsx": "Category filter UI allowing users to select listing categories via rounded buttons.",
  "frontend/src/components/listings/ImageUploader.tsx": "Handles selecting up to three images, converting them to data URLs, and removing uploaded images.",
  "frontend/src/components/listings/ListingCard.tsx": "Displays a listing with its image, title, price, and quantity, and triggers navigation on click.",
  "frontend/src/components/listings/ListingForm.tsx": "Form for creating or editing listings, supporting presets, validation, and image uploads.",
  "frontend/src/components/listings/ListingGrid.tsx": "Renders a responsive grid of ListingCards with loading and empty states.",
  "frontend/src/components/listings/listingPresets.ts": "Provides predefined listing templates with preset titles, descriptions, prices, and quantities.",
  "frontend/src/components/sellers/SellerDisplayName.tsx": "Fetches and displays a seller's display name with a loading fallback.",
  "frontend/src/hooks/mutations/useCreateListing.ts": "Mutation hook to create a listing and invalidate related listing and seller queries.",
  "frontend/src/hooks/mutations/useCreateSellerProfile.ts": "Mutation hook to create a seller profile and refresh seller-related queries.",
  "frontend/src/hooks/mutations/useDeactivateListing.ts": "Mutation hook to deactivate a listing and invalidate affected listing queries.",
  "frontend/src/hooks/mutations/useSaveUserProfile.ts": "Mutation hook to save the current user's profile and refresh the profile query.",
  "frontend/src/hooks/mutations/useUpdateListing.ts": "Mutation hook to update a listing and invalidate its detail and related lists.",
  "frontend/src/hooks/queries/useCurrentUserProfile.ts": "Query hook to fetch the current user's profile with actor-aware loading logic.",
  "frontend/src/hooks/queries/useIsSeller.ts": "Query hook to check whether the current user is a seller.",
  "frontend/src/hooks/queries/useListingDetail.ts": "Query hook to fetch a single listing by ID.",
  "frontend/src/hooks/queries/useListings.ts": "Query hook to load all listings by aggregating listings from every seller.",
  "frontend/src/hooks/queries/useMyListings.ts": "Query hook to fetch listings belonging to the authenticated user.",
  "frontend/src/hooks/queries/useSellers.ts": "Query hook to load a seller profile by principal with graceful failure handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on authentication state and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, exposing identity, login, logout, and status helpers.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and InternetIdentityProvider.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage with search, category filters, and a grid of listings fetched from the backend.",
  "frontend/src/pages/ListingDetailPage.tsx": "Shows detailed listing info with images, seller info, and owner-only deactivation actions.",
  "frontend/src/pages/ProfilePage.tsx": "Manages user profile setup and displays the user’s listings, requiring authentication via Internet Identity.",
  "frontend/src/pages/PublishingSharePage.tsx": "Provides hosting info and lets users copy the public URL of the deployed marketplace.",
  "frontend/src/pages/SellCreateListingPage.tsx": "Allows authenticated users to create new listings using a form and submit them to the backend.",
  "frontend/src/pages/SellEditListingPage.tsx": "Provides an edit page for a listing, loading listing data, checking ownership, and submitting updates via a mutation.",
  "frontend/src/utils/canisterErrors.ts": "Parses canister and agent errors into cleaner user-facing messages with mappings for common backend error types.",
  "frontend/src/utils/urlParams.ts": "Utility functions to read, store, retrieve, and clear URL and session-based parameters, supporting hash and query routing.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Metadata describing the project’s schema, features, and current implementation state for the marketplace application."
}