{
  "backend/main.mo": "Marketplace canister managing listings, user and seller profiles, with access control and storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON mapping of frontend file paths to short functional descriptions for documentation or build planning.",
  "frontend/.env": "Environment variables defining Google verification token and the configured public base URL.",
  "frontend/.env.example": "Template showing required environment variables for Google verification and optional public base URL.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme variables and global styles.",
  "frontend/index.html": "Base HTML template including SEO metadata, Open Graph tags, JSON-LD, and runtime fallback for public URL.",
  "frontend/public/googleb1147599673a3710.html": "Google Search Console verification HTML file.",
  "frontend/public/robots.txt": "Robots.txt allowing all crawlers and pointing to sitemap.xml.",
  "frontend/public/sitemap.xml": "Static sitemap listing homepage, publishing page, and profile page URLs.",
  "frontend/public/static-html-example.html": "Standalone static HTML example demonstrating serving custom pages from the public folder.",
  "frontend/scripts/generate-sitemap.mjs": "Generates a sitemap.xml based on predefined routes and an environment-driven base URL.",
  "frontend/src/App.tsx": "Configures the app's router, routes, and layout, then renders the router within a theming provider.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity with handling for session clearing and retrying.",
  "frontend/src/components/branding/BrandHeader.tsx": "Displays the logo and mascot images in a responsive header layout.",
  "frontend/src/components/common/EmptyState.tsx": "Shows an empty-state message with optional action button for user interactions.",
  "frontend/src/components/common/LoadingState.tsx": "Renders a centered loading spinner with a short loading message.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with header, navigation, content area, and footer.",
  "frontend/src/components/listings/CategoryFilter.tsx": "Renders selectable category buttons to filter listings.",
  "frontend/src/components/listings/ImageUploader.tsx": "Handles client-side image uploads as data URLs, displaying previews and allowing removal.",
  "frontend/src/components/listings/ListingCard.tsx": "Displays a listing preview card with image, title, price, and quantity.",
  "frontend/src/components/listings/ListingForm.tsx": "Form for creating or editing listings with fields, presets, validation, and image upload.",
  "frontend/src/components/listings/ListingGrid.tsx": "Shows a grid of ListingCards or fallback loading/empty states based on data.",
  "frontend/src/components/listings/listingPresets.ts": "Provides predefined listing templates with titles, descriptions, prices, and quantities.",
  "frontend/src/components/sellers/SellerDisplayName.tsx": "Fetches and displays a seller's display name with a loading fallback.",
  "frontend/src/hooks/mutations/useCreateListing.ts": "Mutation hook to create a listing and invalidate related queries on success.",
  "frontend/src/hooks/mutations/useCreateSellerProfile.ts": "Mutation hook to create a seller profile and refresh related queries afterward.",
  "frontend/src/hooks/mutations/useDeactivateListing.ts": "Provides a mutation to deactivate a listing and invalidates related queries.",
  "frontend/src/hooks/mutations/useSaveUserProfile.ts": "Mutation to save the caller's user profile and refresh the current profile query.",
  "frontend/src/hooks/mutations/useUpdateListing.ts": "Mutation to update a listing by ID and invalidate listing-related caches.",
  "frontend/src/hooks/queries/useCurrentUserProfile.ts": "Fetches the current user's profile once the actor is ready.",
  "frontend/src/hooks/queries/useIsSeller.ts": "Checks whether the current actor is a seller.",
  "frontend/src/hooks/queries/useListingDetail.ts": "Fetches detailed data for a single listing by ID.",
  "frontend/src/hooks/queries/useListings.ts": "Loads all listings from all sellers using the actor API.",
  "frontend/src/hooks/queries/useMyListings.ts": "Fetches listings owned by the authenticated user.",
  "frontend/src/hooks/queries/useSellers.ts": "Retrieves a seller profile for a given principal.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance, refetching dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity login, stored identity loading, and context exposure.",
  "frontend/src/index.css": "Tailwind base and theme variables for light and dark mode.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity provider.",
  "frontend/src/pages/HomePage.tsx": "Displays listings with search and category filtering on the home page.",
  "frontend/src/pages/ListingDetailPage.tsx": "Shows full listing details, images, seller info, and owner actions like deactivation.",
  "frontend/src/pages/ProfilePage.tsx": "Profile page that handles user authentication, profile setup, saving profiles, creating seller profiles, and displaying user listings.",
  "frontend/src/pages/PublishingSharePage.tsx": "Page providing deployment URLs and shareable links with clipboard copy actions and hosting information.",
  "frontend/src/pages/SellCreateListingPage.tsx": "Page for authenticated users to create new listings using a form and submit them to the backend.",
  "frontend/src/pages/SellEditListingPage.tsx": "Page for listing owners to edit existing listings, with ownership checks and update submission.",
  "frontend/src/utils/canisterErrors.ts": "Utility for parsing backend canister errors and mapping them to user-friendly messages.",
  "frontend/src/utils/publicUrl.ts": "Utility for resolving the app’s public URL and the current deployment origin.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL parameters and session-based persisted params.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, fonts, animations, and plugins.",
  "project_state.json": "Tracks project state for implementing custom domain support, configurable canonical URLs, sitemap updates, and SEO metadata. Lists existing features, a pending request for custom domain setup, and overall project metadata."
}