{
  "backend/main.mo": "Marketplace canister managing users, sellers, and listings with access control and profile creation functionality.",
  "backend/migration.mo": "Stub migration module exposing a no‑op run function.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for all frontend source files.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and global styling.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with ThemeProvider and Toaster.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button with state handling and query cache clearing.",
  "frontend/src/components/branding/BrandHeader.tsx": "Displays the logo and animated mascot images.",
  "frontend/src/components/common/EmptyState.tsx": "Reusable empty state component with icon, text, and optional action button.",
  "frontend/src/components/common/LoadingState.tsx": "Simple loading indicator with spinner and message.",
  "frontend/src/components/layout/AppLayout.tsx": "App layout with header, navigation, background pattern, main content, and footer.",
  "frontend/src/components/listings/CategoryFilter.tsx": "Category filter button group for selecting listing categories.",
  "frontend/src/components/listings/ImageUploader.tsx": "Allows users to upload up to three images, converting files to data URLs and supporting removal of selected images.",
  "frontend/src/components/listings/ListingCard.tsx": "Displays a listing preview with image, title, price, and quantity, and triggers navigation on click.",
  "frontend/src/components/listings/ListingForm.tsx": "Form for creating or editing listings with preset autofill, image uploads, validation, and submit handling.",
  "frontend/src/components/listings/ListingGrid.tsx": "Renders a responsive grid of listings, handling loading and empty states and navigating to detail pages.",
  "frontend/src/components/listings/listingPresets.ts": "Defines predefined listing templates with titles, descriptions, prices, and quantities.",
  "frontend/src/components/sellers/SellerDisplayName.tsx": "Fetches and displays a seller’s display name, falling back to a default if unavailable.",
  "frontend/src/hooks/mutations/useCreateListing.ts": "Mutation hook that creates a new listing and invalidates related listing and seller queries.",
  "frontend/src/hooks/mutations/useCreateSellerProfile.ts": "Mutation hook to create a seller profile and refresh related seller state queries.",
  "frontend/src/hooks/mutations/useDeactivateListing.ts": "Mutation hook that deactivates a listing and invalidates listing-related caches.",
  "frontend/src/hooks/mutations/useSaveUserProfile.ts": "Mutation hook to save the current user’s profile and refresh its cache.",
  "frontend/src/hooks/mutations/useUpdateListing.ts": "Mutation hook for updating a listing and refreshing associated queries.",
  "frontend/src/hooks/queries/useCurrentUserProfile.ts": "Query hook to fetch the current user’s profile once the actor is ready.",
  "frontend/src/hooks/queries/useIsSeller.ts": "Query hook that checks whether the current user is registered as a seller.",
  "frontend/src/hooks/queries/useListingDetail.ts": "Query hook that retrieves details for a single listing by ID.",
  "frontend/src/hooks/queries/useListings.ts": "Loads all listings by fetching all sellers and aggregating their listings.",
  "frontend/src/hooks/queries/useMyListings.ts": "Fetches listings belonging to the authenticated user based on their principal.",
  "frontend/src/hooks/queries/useSellers.ts": "Fetches a seller’s profile by principal with safe error handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity auth state, loading identities, and handling login/logout flows.",
  "frontend/src/index.css": "Defines Tailwind base layers and CSS variables for light/dark themes and global styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the InternetIdentityProvider before rendering App.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage with search, category filtering, and a grid of listings loaded from the backend.",
  "frontend/src/pages/ListingDetailPage.tsx": "Shows detailed info for a single listing, including images, seller info, and owner actions like deactivation.",
  "frontend/src/pages/ProfilePage.tsx": "Displays the user’s profile, listings, and prompts for profile setup if missing, with options to save user data.",
  "frontend/src/pages/SellCreateListingPage.tsx": "Provides a form for authenticated users to create new listings and handles submission to the backend.",
  "frontend/src/pages/SellEditListingPage.tsx": "Allows owners to edit an existing listing, loading its data and submitting updates back to the backend.",
  "frontend/src/utils/canisterErrors.ts": "No summary available.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and managing hash-based routing params.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugins for the frontend UI.",
  "project_state.json": "Tracks the project’s state, versions, and a detailed list of implemented features for the ICP marketplace app."
}