{
  "backend/main.mo": "Main backend canister implementing marketplace logic for user profiles, seller profiles, listings, access control, and storage mixins.",
  "feature_evidence.json": "Feature evidence report describing requirements for a custom domain input/validation flow and listing the files implementing it.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files including pages, components, hooks, and utilities.",
  "frontend/.env": "Environment configuration specifying Google verification token and the current VITE_PUBLIC_URL value.",
  "frontend/.env.example": "Template env file showing how to configure Google verification and VITE_PUBLIC_URL for deployments.",
  "frontend/index.css": "Tailwind CSS setup with custom CSS variables for light and dark themes.",
  "frontend/index.html": "Base HTML template containing meta tags, SEO placeholders, JSON‑LD schema, and a runtime fallback for public URLs.",
  "frontend/public/googleb1147599673a3710.html": "Google site verification HTML file served statically for search console validation.",
  "frontend/public/robots.txt": "Robots configuration allowing all crawlers and pointing to the sitemap.",
  "frontend/public/sitemap.xml": "Static sitemap listing homepage, publishing page, and profile page with default localhost URLs.",
  "frontend/public/static-html-example.html": "Standalone static HTML example page demonstrating how static files can be served from /public.",
  "frontend/scripts/generate-sitemap.mjs": "Node script that generates sitemap.xml using VITE_PUBLIC_URL or localhost as the base URL.",
  "frontend/src/App.tsx": "Sets up the main app router, routes, theme provider, and global layout/toaster.",
  "frontend/src/components/auth/LoginButton.tsx": "Renders a login/logout button using Internet Identity with state handling and error recovery.",
  "frontend/src/components/branding/BrandHeader.tsx": "Displays the brand logo and mascot with simple layout and animation.",
  "frontend/src/components/common/EmptyState.tsx": "Shows a generic empty-state message with optional action button.",
  "frontend/src/components/common/LoadingState.tsx": "Displays a centered loading spinner and message.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides the app’s layout including header, navigation, footer, and background pattern.",
  "frontend/src/components/listings/CategoryFilter.tsx": "Renders category filter buttons and notifies parent when a category is selected.",
  "frontend/src/components/listings/ImageUploader.tsx": "Handles up to three image uploads as data URLs with preview and remove functionality.",
  "frontend/src/components/listings/ListingCard.tsx": "Displays a listing preview card with image, title, price, and quantity.",
  "frontend/src/components/listings/ListingForm.tsx": "Form for creating or editing listings with presets, validation, and image upload support.",
  "frontend/src/components/listings/ListingGrid.tsx": "Shows a grid of listing cards with loading and empty states.",
  "frontend/src/components/listings/listingPresets.ts": "Defines preset listing templates with predefined fields for quick form filling.",
  "frontend/src/components/sellers/SellerDisplayName.tsx": "Fetches and displays a seller’s display name or a fallback while loading.",
  "frontend/src/hooks/mutations/useCreateListing.ts": "Mutation hook for creating listings and invalidating related queries.",
  "frontend/src/hooks/mutations/useCreateSellerProfile.ts": "Mutation hook for creating a seller profile and refreshing seller-related queries.",
  "frontend/src/hooks/mutations/useDeactivateListing.ts": "Mutation hook to deactivate a listing and refresh listing queries.",
  "frontend/src/hooks/mutations/useSaveUserProfile.ts": "Mutation hook to save a user profile and refresh the current user profile query.",
  "frontend/src/hooks/mutations/useUpdateListing.ts": "Mutation hook to update a listing and invalidate related listing queries.",
  "frontend/src/hooks/queries/useCurrentUserProfile.ts": "Fetches the current user's profile using the actor and exposes loading state helpers.",
  "frontend/src/hooks/queries/useIsSeller.ts": "Returns whether the authenticated user is a seller by calling actor.isSeller().",
  "frontend/src/hooks/queries/useListingDetail.ts": "Fetches a specific listing by ID when an actor is available.",
  "frontend/src/hooks/queries/useListings.ts": "Loads all listings by fetching all sellers and flattening their listings.",
  "frontend/src/hooks/queries/useMyListings.ts": "Fetches listings belonging to the authenticated user's principal.",
  "frontend/src/hooks/queries/useSellers.ts": "Fetches a seller's profile by principal and returns null on error.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an actor tied to the user's identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and client setup.",
  "frontend/src/index.css": "Tailwind CSS setup with theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/HomePage.tsx": "Displays hero, search, filters, and a grid of all listings with client-side filtering.",
  "frontend/src/pages/ListingDetailPage.tsx": "Shows listing details with images, seller info, share options, and owner actions like deactivation.",
  "frontend/src/pages/ProfilePage.tsx": "Manages user profile setup and displays the user's listings, requiring authentication.",
  "frontend/src/pages/PublishingSharePage.tsx": "UI page for sharing deployment URLs, custom domain validation, and copying environment snippets.",
  "frontend/src/pages/SellCreateListingPage.tsx": "Page for authenticated users to create new listings using a ListingForm and mutation hook.",
  "frontend/src/pages/SellEditListingPage.tsx": "Page allowing listing owners to load, edit, and update an existing listing with validation checks.",
  "frontend/src/utils/canisterErrors.ts": "Parses raw canister errors and maps them to user-friendly messages.",
  "frontend/src/utils/customDomain.ts": "Validates custom domains, generates env snippets, and persists domain input in localStorage.",
  "frontend/src/utils/publicUrl.ts": "Retrieves the app’s public URL from env or window origin and exposes deployment URL.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query, hash, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, fonts, and enabling plugins.",
  "project_state.json": "Tracks project state for improving custom domain onboarding, including existing features, pending requests, and known domain‑validation issues. Contains metadata like schema version, project info, and configuration notes."
}