{
  "kind": "build_request",
  "title": "Add in-app publishing guidance and shareable public URL (ICP-only)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a small in-app “Publishing / Share” section that clearly explains the app is published as a web app on the Internet Computer (not Google hosting), and provides the current public site URL (based on window.location.origin) with a one-click copy-to-clipboard action.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "ok can  u publish it",
          "to google"
        ]
      },
      "acceptanceCriteria": [
        "A user can find a “Publishing / Share” section from the main UI (e.g., footer link, header menu item, or a simple settings/about page).",
        "The section contains English text stating that publishing/deployment is to the Internet Computer and that Google hosting is not supported in this project.",
        "The section displays the current public URL (window.location.origin) and includes a “Copy link” button.",
        "Clicking “Copy link” copies the URL to the clipboard and shows a success toast (or equivalent non-intrusive confirmation)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure any user-facing text added for publishing uses clear English phrasing and avoids implying Google Cloud / Google Play deployment is available.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Use English for any user-facing text in the build request.",
          "to google"
        ]
      },
      "acceptanceCriteria": [
        "No new UI copy suggests the app can be deployed to Google Cloud / Google Play.",
        "All newly added user-facing strings are in English."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (read-only UI components must be composed, not edited).",
    "Do not modify immutable frontend hook files (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Backend remains a single Motoko actor in backend/main.mo; no multi-service architecture.",
    "Do not implement Google hosting / Google Cloud deployment (unsupported by platform constraints)."
  ],
  "nonGoals": [
    "Building or deploying to Google Cloud, Firebase Hosting, Google Play Store, or any non-ICP hosting target",
    "Adding third-party authentication providers (only Internet Identity)",
    "Adding CI/CD pipelines or external deployment automation"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}