{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "In-app Publishing/Share section with copyable public URL (ICP-only)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a main-UI-accessible “Publishing / Share” section explaining ICP hosting and showing a copy-to-clipboard public URL with confirmation.",
      "acceptanceCriteria": [
        "A user can find a “Publishing / Share” section from the main UI (e.g., footer link, header menu item, or a simple settings/about page).",
        "The section contains English text stating that publishing/deployment is to the Internet Computer and that Google hosting is not supported in this project.",
        "The section displays the current public URL (window.location.origin) and includes a “Copy link” button.",
        "Clicking “Copy link” copies the URL to the clipboard and shows a success toast (or equivalent non-intrusive confirmation)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PublishingSharePage.tsx",
          "operation": "create",
          "description": "Create a dedicated “Publishing / Share” page that: (1) explains the app is published as a web app on the Internet Computer (ICP) and that Google hosting is not supported, (2) reads and displays the current public URL using window.location.origin, and (3) provides a one-click “Copy link” action using the browser clipboard API with a success confirmation using the existing toast system (sonner). Use shadcn/ui components (e.g., Card, Button) for layout and actions; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register and wire a new route (e.g., /publishing) to PublishingSharePage so it is navigable within the app. Ensure the route is added to the route tree. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Add a visible link in the main UI (footer is preferred to keep nav minimal) labeled “Publishing / Share” that navigates to the new PublishingSharePage route. Keep it consistent with existing TanStack Router Link usage. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure newly added publishing-related UI copy is clear English and explicitly avoids implying Google deployment options exist.",
      "acceptanceCriteria": [
        "No new UI copy suggests the app can be deployed to Google Cloud / Google Play.",
        "All newly added user-facing strings are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PublishingSharePage.tsx",
          "operation": "modify",
          "description": "Review and refine all user-facing strings in the Publishing / Share UI to ensure clear English phrasing, explicitly ICP-focused hosting/deployment guidance, and no implication of Google Cloud/Google Play availability. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Ensure the new navigation link label (“Publishing / Share”) and any surrounding footer text added/adjusted is in clear English and does not imply Google deployment. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}