{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Fidget Market is an Internet Computer (Motoko) + React marketplace app for kid-friendly fidget-toy listings. Users authenticate with Internet Identity, set up a user profile (display name), optionally create a seller profile, and create/edit/remove listings with images. The backend canister enforces role-based access control (admin/user/guest), stores user/seller profiles and listings, and includes a blob-storage maintenance mixin for storage gateway authorization, dead-blob cleanup, and cycles refills.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Marketplace canister core domain (users, sellers, listings)",
      "synonyms": [
        "marketplace backend",
        "Motoko marketplace canister"
      ],
      "description": "Motoko canister defines and stores UserProfile, SellerProfile, and Listing records, with in-memory Maps for profiles and listings and basic marketplace query endpoints.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Role-based access control with admin bootstrap secret",
      "synonyms": [
        "RBAC",
        "access-control",
        "admin token initialization"
      ],
      "description": "Implements admin/user/guest roles; first initialization assigns admin if the caller supplies a secret matching an environment variable, otherwise assigns user; supports admin-only role assignment and role checks for protected methods.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Frontend Internet Identity authentication",
      "synonyms": [
        "Internet Identity login",
        "II auth"
      ],
      "description": "Provides a React context for Internet Identity using @dfinity/auth-client, including persisted delegation handling, login/logout, and a LoginButton with state handling.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Backend actor creation and access-control initialization",
      "synonyms": [
        "useActor",
        "authenticated actor"
      ],
      "description": "Creates anonymous or authenticated canister actors based on identity; for authenticated users, calls _initializeAccessControlWithSecret using a secret read from URL hash/session and refreshes React Query caches when the actor changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "User profile management (save and fetch)",
      "synonyms": [
        "display name profile",
        "user profile CRUD"
      ],
      "description": "Allows authenticated users to save their own profile (displayName) and fetch it; backend enforces user-only access and restricts viewing other users’ profiles to self or admin.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Seller profiles and seller directory",
      "synonyms": [
        "seller onboarding",
        "seller profile lookup"
      ],
      "description": "Backend supports checking seller status, creating a seller profile, listing all sellers, and fetching a seller profile by principal; frontend includes query/mutation hooks and a SellerDisplayName component.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Auto-create seller profile during listing creation",
      "synonyms": [
        "ensureSellerProfile",
        "implicit seller creation"
      ],
      "description": "Backend createListing ensures the caller has a SellerProfile, auto-creating one using the user profile display name (or a default principal-based name) if missing.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Listing CRUD with ownership checks",
      "synonyms": [
        "create/update/delete listing",
        "seller listing management"
      ],
      "description": "Authenticated users can create listings; sellers can update and deactivate their own listings; backend enforces ownership; listings are available via getListing and getListingsBySeller.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Marketplace browsing UI and routing",
      "synonyms": [
        "home feed",
        "listing detail pages"
      ],
      "description": "React SPA routes include home browse page, listing detail page with image carousel, profile page, and seller create/edit listing pages; navigation uses TanStack Router.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Listing form with presets, validation, and images",
      "synonyms": [
        "sell form",
        "listing templates"
      ],
      "description": "Reusable ListingForm supports create/edit, optional preset auto-fill, field validation, price conversion to cents (BigInt), and up to 3 images via ImageUploader with previews/removal.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Client-side search and category filtering",
      "synonyms": [
        "listing filter",
        "search UI"
      ],
      "description": "Home page filters aggregated listings by search term and a simple category button group (Pop-it/Spinner/Squishy/Cube/Other) using title-based matching.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Actionable error handling for canister calls",
      "synonyms": [
        "canister error parsing",
        "user-friendly toasts"
      ],
      "description": "Frontend includes parseCanisterError to extract trap/reject messages and map common backend errors to friendly text; used in listing creation and profile setup flows with toast notifications.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Blob-storage maintenance endpoints and authorization registry",
      "synonyms": [
        "storage gateway authorization",
        "dead blob pruning",
        "cycles refill"
      ],
      "description": "Includes a blob-storage mixin providing endpoints to update authorized gateway principals from a cashier canister, list/prune dead blobs with authorization checks, and refill the cashier with available cycles.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "UI theming and reusable layout states",
      "synonyms": [
        "AppLayout",
        "tailwind/shadcn UI"
      ],
      "description": "AppLayout provides consistent header/nav/footer and background styling; shared LoadingState and EmptyState components handle common UX states; ThemeProvider enables light/dark mode.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-add-a-small-in-app-publishing-share-section-that-clearly-explains-the-app-is-published-as-a-web-app-on-the-internet-computer-not-google-hosting-and-provides-the-current-public-site-url-based-on-window-location-origin-with-a-one-click-copy-to-clipboard-action",
      "title": "Add a small in-app “Publishing / Share” section that clearly explains the app is published as a web app on the Internet Computer (not Google hosting), and provides the current public site URL (based on window.location.origin) with a one-click copy-to-clipboard action.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-ensure-any-user-facing-text-added-for-publishing-uses-clear-english-phrasing-and-avoids-implying-google-cloud-google-play-deployment-is-available",
      "title": "Ensure any user-facing text added for publishing uses clear English phrasing and avoids implying Google Cloud / Google Play deployment is available.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Support publishing/deploying the Fidget Market web app to a Google-hosted destination (e.g., Google Cloud hosting) in addition to Internet Computer deployment.",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "Internet Computer architecture: a Motoko marketplace canister (backend/main.mo) with a React SPA frontend.",
    "Motoko canister composition via mixins: authorization (MixinAuthorization) and blob-storage maintenance endpoints (blob-storage/Mixin).",
    "Role-based access control module (access-control.mo) with first-time initialization that assigns roles and supports admin role assignment.",
    "Frontend uses TanStack Router for routing and @tanstack/react-query for caching, mutations, and query invalidation.",
    "Custom actor lifecycle hook (useActor) recreates an authenticated/anonymous backend actor based on Internet Identity state and forces dependent query refetches when the actor changes.",
    "Internet Identity integration via @dfinity/auth-client with a React context provider (useInternetIdentity) and explicit login/logout UI.",
    "Sensitive “admin token” handling via hash-fragment secrets persisted to sessionStorage and removed from URL (utils/urlParams.ts).",
    "Listings browsing is done by fetching all sellers and aggregating their embedded listing arrays client-side (useGetAllListings).",
    "UI is built with TailwindCSS + shadcn/ui primitives, common loading/empty-state components, and theme support (next-themes).",
    "Blob-storage maintenance uses IC prim storage APIs (e.g., getDeadBlobs/pruneConfirmedDeadBlobs) and an authorization registry refreshed from a “cashier” canister."
  ],
  "known_issues": [
    "Listing images are stored/handled as data URLs in frontend and persisted directly as Text arrays in listing records; this can bloat canister state and may hit message/state size limits. The included blob-storage canister/mixin is not actually used by the ImageUploader/listing flow.",
    "Access-control initialization depends on the CAFFEINE_ADMIN_TOKEN environment variable; if missing, authenticated actor initialization (_initializeAccessControlWithSecret) will trap and can break the app for logged-in users.",
    "Storage cashier principal env var name appears misspelled as CAFFFEINE_STORAGE_CASHIER_PRINCIPAL (extra 'F'), which can cause runtime traps if deployments use the expected spelling.",
    "AccessControl.getUserRole traps with \"User is not registered\" until initialization runs; any call path that bypasses frontend’s initialization step can fail unexpectedly.",
    "Profile setup flow always attempts createSellerProfile after saving user profile; if a seller profile was auto-created earlier (e.g., via createListing), createSellerProfile traps (“already exists”) and the UI may not close the setup dialog even though the user profile save succeeded.",
    "Listing IDs are generated as \"<title> #<increment>\"; IDs are not sanitized/URL-friendly and may be unstable/awkward for long titles or repeated titles.",
    "Two sources of truth for listings exist (global listings map and sellerProfiles[].listings); frontend “all listings” view relies on sellerProfiles listings, so any divergence could lead to inconsistent results.",
    "No server-side pagination/search/filtering; home page potentially loads all sellers and all listings on every refresh, which may not scale well."
  ],
  "isFixRequest": false,
  "gameProjectType": "none",
  "projectName": "Fidget Market",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}